<?xml version="1.0"?>
<net name="age_gender" version="3" batch="1">
	<layers>
		<layer name="data" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>62</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer name="conv1" type="Convolution" precision="FP32" id="1">
			<data dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>62</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="192" />
				<weights offset="192" size="5184" />
			</blobs>
		</layer>
		<layer name="pool1" type="Pooling" precision="FP32" id="2">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer name="relu1" type="ReLU" precision="FP32" id="3">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2" type="Convolution" precision="FP32" id="4">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5376" size="256" />
				<weights offset="5632" size="110592" />
			</blobs>
		</layer>
		<layer name="pool2" type="Pooling" precision="FP32" id="5">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer name="relu2" type="ReLU" precision="FP32" id="6">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer name="conv3" type="Convolution" precision="FP32" id="7">
			<data dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
			<blobs>
				<biases offset="116224" size="384" />
				<weights offset="116608" size="221184" />
			</blobs>
		</layer>
		<layer name="pool3" type="Pooling" precision="FP32" id="8">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer name="relu3" type="ReLU" precision="FP32" id="9">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer name="conv4" type="Convolution" precision="FP32" id="10">
			<data dilations="1,1" group="1" kernel="3,3" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<biases offset="337792" size="768" />
				<weights offset="338560" size="663552" />
			</blobs>
		</layer>
		<layer name="relu4" type="ReLU" precision="FP32" id="11">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5" type="Convolution" precision="FP32" id="12">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1002112" size="1024" />
				<weights offset="1003136" size="1769472" />
			</blobs>
		</layer>
		<layer name="relu5" type="ReLU" precision="FP32" id="13">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="gender_conv1" type="Convolution" precision="FP32" id="14">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2772608" size="1024" />
				<weights offset="2773632" size="2359296" />
			</blobs>
		</layer>
		<layer name="relu6_g" type="ReLU" precision="FP32" id="15">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="gender_conv2" type="Convolution" precision="FP32" id="16">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5132928" size="2048" />
				<weights offset="5134976" size="524288" />
			</blobs>
		</layer>
		<layer name="relu7_g" type="ReLU" precision="FP32" id="17">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="gender_conv3" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5659264" size="8" />
				<weights offset="5659272" size="4096" />
			</blobs>
		</layer>
		<layer name="prob" type="SoftMax" precision="FP32" id="19">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="age_conv1" type="Convolution" precision="FP32" id="20">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5663368" size="1024" />
				<weights offset="5664392" size="2359296" />
			</blobs>
		</layer>
		<layer name="relu6_a" type="ReLU" precision="FP32" id="21">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="age_conv2" type="Convolution" precision="FP32" id="22">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="8023688" size="2048" />
				<weights offset="8025736" size="524288" />
			</blobs>
		</layer>
		<layer name="relu7_a" type="ReLU" precision="FP32" id="23">
			<data negative_slope="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="age_conv3" type="Convolution" precision="FP32" id="24">
			<data dilations="1,1" group="1" kernel="1,1" output="1" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="8550024" size="4" />
				<weights offset="8550028" size="2048" />
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>age_conv1</name>
			<min>-0.071762, -0.034348, -0.044501, -0.059929, -0.292372, -0.051988, -0.392406, -0.055431, -0.069043, -0.109382, -0.164125, -0.041149, -0.044706, -0.062361, -0.311940, -0.035871, -0.175690, -0.409768, -0.207443, -0.043587, -0.063324, -0.052416, -0.055902, -0.146651, -0.301764, -0.144741, -0.036972, -0.056921, -0.034464, -0.038669, -0.306058, -0.219730, -0.210625, -0.051750, -0.051007, -0.081134, -0.052356, -0.073911, -0.049670, -0.065655, -0.019538, -0.062670, -0.082633, -0.087421, -0.067040, -0.257414, -0.173547, -0.052788, -0.049698, -0.357445, -0.083774, -0.027296, -0.032315, -0.087571, -0.051477, -0.083996, -0.261695, -0.185260, -0.345077, -0.017703, -0.023537, -0.048126, -0.058008, -0.183535, -0.037135, -0.062020, -0.196582, -0.115025, -0.059159, -0.056682, -0.044251, -0.050705, -0.046583, -0.066712, -0.049900, -0.037901, -0.272994, -0.037911, -0.045414, -0.262550, -0.062917, -0.058917, -0.060471, -0.056130, -0.186397, -0.221525, -0.067044, -0.081882, -0.047949, -0.390590, -0.080128, -0.160925, -0.149315, -0.286253, -0.037566, -0.056894, -0.036542, -0.025562, -0.046906, -0.075132, -0.154952, -0.098298, -0.040043, -0.377790, -0.054692, -0.075532, -0.066024, -0.056763, -0.054655, -0.046169, -0.077552, -0.052617, -0.247866, -0.058594, -0.285803, -0.214514, -0.085451, -0.052104, -0.059144, -0.205419, -0.062076, -0.019726, -0.209075, -0.050969, -0.061316, -0.241697, -0.198382, -0.069222, -0.291652, -0.434460, -0.060673, -0.058618, -0.033217, -0.043261, -0.146153, -0.033256, -0.246183, -0.040430, -0.167327, -0.063009, -0.019263, -0.163004, -0.330822, -0.053198, -0.041988, -0.076098, -0.281079, -0.337937, -0.165832, -0.054893, -0.051675, -0.087530, -0.069611, -0.186143, -0.162324, -0.272937, -0.190218, -0.183956, -0.072736, -0.049200, -0.062736, -0.169487, -0.063387, -0.059838, -0.152343, -0.065171, -0.108558, -0.191645, -0.027152, -0.070773, -0.345627, -0.042023, -0.179033, -0.141731, -0.036303, -0.324176, -0.057658, -0.066778, -0.041749, -0.062411, -0.059612, -0.024574, -0.053277, -0.028050, -0.040980, -0.069316, -0.260858, -0.161875, -0.062050, -0.054647, -0.063524, -0.140745, -0.048281, -0.052037, -0.040397, -0.084834, -0.039959, -0.213205, -0.026424, -0.058026, -0.192518, -0.047589, -0.071091, -0.041014, -0.429098, -0.089505, -0.217459, -0.055391, -0.030705, -0.058243, -0.051784, -0.068969, -0.039315, -0.319795, -0.165772, -0.053117, -0.169850, -0.049719, -0.068449, -0.064251, -0.147767, -0.068827, -0.040273, -0.169113, -0.234016, -0.138105, -0.200719, -0.036307, -0.178980, -0.182747, -0.031076, -0.075277, -0.224951, -0.438205, -0.207490, -0.139654, -0.051572, -0.068299, -0.057370, -0.036195, -0.162409, -0.275149, -0.077715, -0.086657, -0.113161, -0.045329, -0.074733, -0.028391, -0.153273, -0.045253, -0.082307, -0.049576, -0.060726, -0.062081, -0.034809, -0.057386</min>
			<max>-0.071479, -0.034162, -0.044263, -0.059743, 0.475543, -0.051740, 0.385766, -0.055259, -0.068810, 0.252301, 0.203863, -0.040965, -0.044498, -0.062125, 0.166389, -0.035658, 0.249750, 0.344959, 0.184621, -0.043397, -0.063134, -0.052169, -0.055685, 0.205508, 0.169563, 0.213194, -0.036759, -0.056721, -0.034240, -0.038454, 0.434814, 0.212750, 0.200665, -0.051438, -0.050822, -0.080935, -0.052142, -0.073678, -0.049469, -0.065456, -0.019286, -0.062428, -0.082430, 0.246595, -0.066844, 0.435502, 0.242002, -0.052642, -0.049456, 0.125966, -0.083563, -0.026986, -0.031983, -0.087380, -0.051230, -0.083815, 0.379244, 0.180722, 0.141477, -0.017477, -0.023328, -0.047956, -0.057819, 0.235754, -0.036948, -0.061816, 0.215520, 0.255330, -0.058963, -0.056478, -0.044019, -0.050414, -0.046355, -0.066484, -0.049698, -0.037703, 0.099039, -0.037736, -0.045236, 0.240541, -0.062682, -0.058713, -0.060242, -0.055947, 0.254289, 0.253386, -0.066782, -0.081635, -0.047704, 0.378904, -0.079950, 0.222633, 0.239245, 0.161491, -0.037322, -0.056707, -0.036316, -0.025351, -0.046602, -0.074924, 0.251371, -0.098119, -0.039852, 0.154238, -0.054450, -0.075336, -0.065718, -0.056584, -0.054459, -0.045978, -0.077361, -0.052392, 0.177428, -0.058380, 0.149212, 0.206406, -0.085272, -0.051764, -0.058945, 0.211801, -0.061830, -0.019508, 0.173759, -0.050775, -0.061116, 0.134706, 0.216024, -0.069025, 0.403231, 0.316309, -0.060474, -0.058417, -0.033014, -0.043070, 0.225708, -0.033072, 0.190160, -0.040238, 0.274888, -0.062782, -0.019061, 0.260795, 0.145775, -0.052909, -0.041768, -0.075893, 0.151759, 0.479718, 0.292053, -0.054724, -0.051511, -0.087359, -0.069377, 0.220496, 0.236322, 0.161084, 0.237591, 0.247904, -0.072533, -0.049021, -0.062515, 0.209333, -0.063172, -0.059642, 0.250346, -0.064957, 0.245640, 0.232973, -0.026848, -0.070504, 0.445654, -0.041787, 0.216886, 0.229451, -0.036121, 0.357023, -0.057435, -0.066563, -0.041594, -0.062130, -0.059283, -0.024336, -0.052981, -0.027836, -0.040790, -0.069143, 0.210114, 0.235063, -0.061797, -0.054418, -0.063311, 0.260018, -0.048064, -0.051766, -0.040219, -0.084624, -0.039776, 0.193985, -0.026175, -0.057805, 0.221818, -0.047341, -0.070889, -0.040858, 0.363044, -0.089345, 0.200652, -0.055206, -0.030513, -0.058046, -0.051604, -0.068686, -0.039105, 0.152928, 0.226509, -0.052921, 0.227963, -0.049410, -0.068276, -0.063920, 0.264205, -0.068626, -0.039998, 0.231485, 0.227403, 0.251420, 0.249682, -0.036120, 0.264421, 0.254861, -0.030746, -0.075037, 0.192304, 0.406614, 0.170388, 0.245175, -0.051338, -0.068038, -0.057145, -0.035954, 0.226941, 0.208502, -0.077486, -0.072210, 0.230763, -0.045133, -0.074532, -0.028209, 0.256989, -0.045071, -0.082092, -0.049389, -0.060428, -0.061911, -0.034559, -0.057204</max>
		</layer>
		<layer>
			<name>age_conv2</name>
			<min>-0.126259, -0.043403, -0.048882, -0.033663, -0.235226, -0.145705, -0.052512, -0.049451, -0.057030, -0.097776, -0.087774, -0.045838, -0.059624, -0.110678, -0.047572, -0.178488, -0.056465, -0.045067, -0.046502, -0.101612, -0.055423, -0.024796, -0.041179, -0.055438, -0.055696, -0.050294, -0.054526, -0.038049, -0.201031, -0.106163, -0.079784, -0.064859, -0.070786, -0.044933, -0.031515, -0.109849, -0.053005, -0.101223, -0.052812, -0.060524, -0.174955, -0.045390, -0.067990, -0.162018, -0.059688, -0.097374, -0.090981, -0.081416, -0.026989, -0.047740, -0.132999, -0.050859, -0.143002, -0.149078, -0.085073, -0.100412, -0.054838, -0.045231, -0.064886, -0.050223, -0.078421, -0.060962, -0.078064, -0.118616, -0.097732, -0.050608, -0.064549, -0.046496, -0.052681, -0.113625, -0.061549, -0.038048, -0.036375, -0.009724, -0.046941, -0.031963, -0.057970, -0.041156, -0.032564, -0.131631, -0.040273, -0.074225, -0.058829, -0.131146, -0.007910, -0.040031, -0.020848, -0.070683, -0.053264, -0.032143, -0.008499, -0.039079, -0.122887, -0.049520, -0.097696, -0.087358, -0.047838, -0.086990, -0.038790, -0.065956, -0.105480, -0.042292, -0.035889, -0.058128, -0.053777, -0.135345, -0.164542, -0.171485, -0.055380, -0.172511, -0.193326, -0.060260, -0.076590, -0.005436, -0.033904, -0.111572, -0.136196, -0.031048, -0.252005, -0.116086, -0.043345, -0.053378, -0.031200, -0.136054, -0.134899, -0.035329, -0.061814, -0.157062, -0.074983, -0.157607, -0.063194, -0.020878, -0.044514, -0.059163, -0.037693, -0.061568, -0.026054, -0.133310, -0.029458, -0.163505, -0.033461, -0.172490, -0.034853, -0.058126, -0.159446, -0.045516, -0.053012, -0.128917, -0.040106, -0.013697, -0.061267, -0.152124, -0.202115, -0.023171, -0.047871, -0.246910, -0.034348, -0.162885, -0.051925, -0.059480, -0.036895, -0.037780, -0.040993, -0.088360, -0.038201, -0.149772, -0.033908, -0.041917, -0.098074, -0.052369, -0.207896, -0.051745, -0.034565, -0.158761, -0.116437, -0.042396, -0.081539, -0.076720, -0.042532, -0.052875, -0.039191, -0.044440, -0.038312, -0.150978, -0.106367, -0.186475, -0.048020, -0.143151, -0.206340, -0.115619, -0.043709, -0.077943, -0.047737, -0.054277, -0.035073, -0.040921, -0.094922, -0.060772, -0.039028, -0.052488, -0.126030, -0.145746, -0.023934, -0.100794, -0.044499, -0.054514, -0.029469, -0.064981, -0.047117, -0.034623, -0.049710, -0.049601, -0.045376, -0.155374, -0.090655, -0.237181, -0.066063, -0.049678, -0.047780, -0.035971, -0.123721, -0.074488, -0.096708, -0.075958, -0.051348, -0.093078, -0.123331, -0.170692, -0.164449, -0.041777, -0.029294, -0.036671, -0.031948, -0.055603, -0.079086, -0.051832, -0.066802, -0.037121, -0.148425, -0.032364, -0.031330, -0.040630, -0.056427, -0.122795, -0.056353, -0.082828, -0.071322, -0.010090, -0.046082, -0.169387, -0.142981, -0.143564, -0.053870, -0.040355, -0.058808, -0.116683, -0.054978, -0.034892, -0.044979, -0.080224, -0.041295, -0.148498, -0.050144, -0.043049, -0.044567, -0.194941, -0.011815, -0.046112, -0.037526, -0.061769, -0.077489, -0.052938, -0.168234, -0.191896, -0.066892, -0.052001, -0.043654, -0.037176, -0.041680, -0.032308, -0.151671, -0.071142, -0.071263, -0.130685, -0.041887, -0.056606, -0.037433, -0.049117, -0.040667, -0.047167, -0.070965, -0.053043, -0.127978, -0.015582, -0.042925, -0.093609, -0.097705, -0.067340, -0.052182, -0.220450, -0.055245, -0.110382, -0.016657, -0.009717, -0.035301, -0.035094, -0.202887, -0.044734, -0.033334, -0.030509, -0.230890, -0.082876, -0.096531, -0.074877, -0.063655, -0.031835, -0.056326, -0.060906, -0.092714, -0.020382, -0.117929, -0.089880, -0.036731, -0.064790, -0.064259, -0.065868, -0.202898, -0.045764, -0.029000, -0.054116, -0.025871, -0.048127, -0.074349, -0.058213, -0.037192, -0.016527, -0.007987, -0.057993, -0.056674, -0.060562, -0.146591, -0.017773, -0.024168, -0.129682, -0.069859, -0.050211, -0.057072, -0.060341, -0.115765, -0.044179, -0.042250, -0.051930, -0.029812, -0.050846, -0.121489, -0.072704, -0.017587, -0.184475, -0.022091, -0.011925, -0.057713, -0.067165, -0.195665, -0.031010, -0.069083, -0.157173, -0.097791, -0.059768, -0.054104, -0.012997, -0.036975, -0.060768, -0.025072, -0.174431, -0.026687, -0.137320, -0.029220, -0.075104, -0.104522, -0.038167, -0.132793, -0.105852, -0.032207, -0.024080, -0.112915, -0.025986, -0.016560, -0.063036, -0.047630, -0.037367, -0.043613, -0.057035, -0.230692, -0.201855, -0.105134, -0.038403, -0.039255, -0.091107, -0.079541, -0.052437, -0.026857, -0.009827, -0.137607, -0.064143, -0.113461, -0.040772, -0.034266, -0.038240, -0.073058, -0.059090, -0.042350, -0.065634, -0.139813, -0.040003, -0.051388, -0.054872, -0.013498, -0.053020, -0.071956, -0.060071, -0.138027, -0.047586, -0.058568, -0.030141, -0.084118, -0.007932, -0.049479, -0.051595, -0.054059, -0.047654, -0.070128, -0.065044, -0.072385, -0.116417, -0.006549, -0.065431, -0.080887, -0.050719, -0.042941, -0.022555, -0.021905, -0.010692, -0.014759, -0.049756, -0.087868, -0.202448, -0.100120, -0.109446, -0.150122, -0.036132, -0.033093, -0.035120, -0.043805, -0.034257, -0.051570, -0.128194, -0.045956, -0.111457, -0.046060, -0.134049, -0.033620, -0.084726, -0.110482, -0.053644, -0.111831, -0.068156, -0.072972, -0.109939, -0.044903, -0.050389, -0.051339, -0.118356, -0.031634, -0.048940, -0.098300, -0.038050, -0.169984, -0.038843, -0.043921, -0.031839, -0.015716, -0.040154, -0.090783, -0.132662, -0.042276, -0.253596, -0.063365, -0.047890, -0.032246, -0.149390, -0.157910, -0.030375, -0.109086, -0.014018, -0.036613, -0.084102, -0.211381, -0.060194, -0.006488, -0.064970, -0.032636, -0.049216, -0.057540, -0.049104, -0.065600, -0.029028, -0.008217, -0.054558, -0.013908, -0.035900, -0.046318, -0.111434</min>
			<max>-0.126238, 0.054431, 0.046098, 0.051536, -0.068147, -0.145654, 0.041077, 0.053274, 0.044895, 0.034703, 0.039309, 0.060294, 0.048223, -0.110574, 0.029199, -0.178422, 0.048970, 0.050846, 0.049515, -0.101507, 0.042336, 0.061825, 0.051892, 0.047580, 0.049108, 0.049971, -0.054484, 0.046533, -0.200885, -0.106126, 0.046477, 0.039450, -0.070654, 0.046099, 0.054449, -0.109757, 0.041800, 0.038230, 0.043247, 0.039342, -0.037717, 0.052723, -0.067916, -0.161948, 0.047523, -0.097315, -0.090927, -0.081371, 0.058125, 0.052559, -0.132923, 0.048140, -0.142718, -0.148559, -0.085020, -0.100375, 0.050020, 0.057464, -0.064777, 0.045439, -0.078365, 0.041846, -0.077949, -0.118511, -0.097699, 0.051644, 0.045564, 0.055056, 0.036285, -0.113571, 0.041378, -0.003093, 0.054686, 0.068988, 0.050765, 0.050001, 0.046221, 0.059792, 0.058621, -0.131449, 0.056987, -0.074179, 0.038229, -0.131047, 0.059231, 0.053049, 0.062798, 0.046106, 0.052239, -0.031905, 0.064774, 0.064736, -0.122854, 0.052280, -0.096528, -0.087303, -0.047742, 0.033956, 0.055726, -0.065903, -0.105369, 0.050664, 0.061380, 0.019314, 0.043022, -0.135273, -0.164520, -0.171440, 0.048749, -0.042711, -0.193175, 0.028742, -0.076549, 0.065266, 0.047779, -0.111516, -0.136096, 0.059938, -0.251762, -0.116047, -0.043304, 0.047527, 0.049606, -0.135938, -0.134742, 0.062961, 0.041529, -0.156976, -0.001851, -0.157484, 0.007078, 0.063489, 0.051958, 0.038741, 0.052521, 0.038062, 0.048329, -0.133176, 0.059062, -0.163419, 0.054327, -0.172403, -0.034765, 0.059822, -0.159411, 0.045652, 0.047092, -0.128805, 0.057179, 0.063787, 0.037117, -0.152056, -0.201927, -0.023064, 0.049166, -0.246642, 0.052071, -0.162854, 0.011442, 0.043642, 0.053348, 0.047427, 0.043009, 0.036094, 0.044193, -0.149638, 0.053834, 0.048579, -0.098033, 0.048132, -0.053860, 0.046910, 0.049765, -0.158682, -0.116342, 0.061807, -0.081427, -0.003777, 0.040009, 0.049172, 0.041340, 0.042122, 0.056705, -0.150919, -0.106273, -0.186403, 0.058127, -0.143090, -0.206204, -0.115498, 0.046857, -0.077860, 0.050537, 0.054062, 0.048798, 0.051268, -0.094875, 0.042072, 0.061973, 0.057332, -0.125964, -0.145663, -0.003137, -0.100723, 0.059592, 0.054994, 0.061889, -0.064849, 0.053224, 0.052819, 0.004032, -0.049541, 0.047419, -0.155347, 0.045091, -0.236790, 0.042614, 0.053601, 0.053997, 0.042301, -0.123584, 0.042874, 0.035228, -0.000172, 0.043344, -0.093046, -0.123281, -0.003820, -0.164397, 0.052707, 0.062909, 0.055367, 0.051175, 0.035587, -0.078938, 0.053229, -0.066719, 0.051569, -0.148392, 0.042814, 0.047113, 0.045966, 0.039450, -0.122727, 0.006225, -0.082731, 0.006813, 0.058756, 0.048314, -0.169356, -0.142917, -0.143531, 0.048558, 0.060530, 0.001408, -0.116611, 0.051206, 0.035265, 0.051799, -0.080104, 0.050119, -0.148448, 0.056934, 0.038155, -0.044514, -0.040443, 0.058378, 0.047733, 0.044607, -0.061665, -0.077408, 0.047442, -0.168121, -0.191866, -0.066819, 0.044506, -0.043571, 0.062741, -0.041586, 0.058581, -0.151561, -0.071068, 0.041014, -0.130606, 0.056690, 0.021491, 0.040632, 0.049592, 0.053852, 0.040981, 0.048714, 0.048351, -0.127886, 0.069074, 0.060668, -0.040558, -0.097654, -0.067175, 0.050757, -0.220380, 0.032230, -0.110342, 0.055697, 0.059698, 0.056672, 0.055579, -0.053999, 0.053806, 0.065368, -0.030038, -0.230618, -0.082707, -0.096441, 0.037929, -0.063552, 0.054375, 0.048018, 0.045747, -0.092640, 0.052842, -0.117845, -0.089823, 0.058416, 0.043045, -0.064216, 0.043637, -0.201969, 0.056222, 0.058032, 0.045771, 0.067918, 0.052797, -0.074236, 0.050391, 0.053746, 0.057493, 0.061981, -0.057894, 0.040992, 0.052618, -0.146523, 0.062328, 0.050552, -0.129639, -0.069836, 0.049244, 0.043584, -0.055917, -0.115659, 0.039616, 0.053322, -0.051863, 0.049660, 0.054294, -0.121428, -0.072630, 0.060922, -0.184379, 0.055849, 0.062681, 0.060860, -0.067106, -0.195589, -0.030938, -0.068944, -0.156943, -0.097718, 0.043899, 0.060605, 0.064989, 0.044789, 0.010656, 0.051860, -0.174377, 0.051131, -0.137211, -0.029087, 0.039090, -0.104407, 0.060099, -0.132763, -0.105821, 0.054651, 0.054695, -0.112805, 0.067723, 0.066919, 0.043004, 0.055780, 0.051541, 0.053955, 0.042570, -0.060345, -0.201791, -0.105096, 0.044178, 0.054146, -0.091054, 0.034528, 0.045647, 0.061325, 0.063552, -0.137531, 0.049792, -0.113347, 0.049471, 0.060006, 0.043861, 0.042722, 0.051262, 0.053632, 0.038695, -0.139625, 0.038494, -0.051303, 0.051680, 0.058067, 0.032747, -0.071905, 0.042602, -0.137976, 0.050011, -0.058526, 0.040236, -0.084087, 0.065798, 0.049203, 0.056456, 0.049884, 0.049342, -0.001267, -0.064931, 0.043504, -0.116364, 0.066075, 0.041307, 0.044762, 0.051437, 0.051871, 0.058368, 0.059277, 0.065649, 0.065532, -0.049662, -0.087751, -0.201613, -0.099953, -0.109400, -0.150033, 0.048277, 0.049736, 0.056669, 0.052816, -0.003999, 0.051492, -0.128132, 0.019811, 0.038534, 0.055652, -0.133958, 0.051456, 0.045041, -0.110380, 0.053491, -0.111791, 0.002713, 0.028222, -0.109876, 0.043954, 0.055273, 0.040435, -0.118293, 0.048985, 0.051693, -0.098220, 0.047408, -0.169850, 0.052197, 0.057426, 0.041160, -0.014903, 0.052618, -0.090744, -0.132328, 0.065194, -0.253500, 0.039808, 0.048502, 0.053887, -0.035971, -0.157785, 0.048242, -0.109032, -0.008404, 0.053479, 0.040384, -0.211270, 0.047904, 0.066170, 0.041110, 0.060928, 0.047923, 0.047859, 0.056098, 0.038700, 0.055376, 0.062489, -0.054382, 0.056394, 0.053900, -0.046204, -0.111284</max>
		</layer>
		<layer>
			<name>age_conv3</name>
			<min>0.198392</min>
			<max>0.597485</max>
		</layer>
		<layer>
			<name>conv1</name>
			<min>-9.302221, -7.508159, -9.531015, -3.939705, -9.518824, -6.253033, -19.804804, -6.115538, -5.576653, -5.535155, -9.795169, -5.434760, -9.740367, -15.730733, -2.755115, -16.815464, -10.187249, -4.238422, -9.561346, -6.001817, -2.529344, -2.506418, -15.929134, -6.345579, -6.309146, -3.975494, -5.967710, -2.969739, -5.505874, -9.265588, -11.898907, -3.991882, -9.844462, -5.813719, -13.533174, -9.426435, -7.628995, -5.177453, -9.670385, -10.307930, -21.277349, -7.150378, -3.568200, -9.569053, -6.622832, -15.903770, -3.558901, -17.805973</min>
			<max>9.761258, 7.048532, 9.837067, 10.704053, 9.016779, 5.276362, 16.901321, 5.572105, 7.653290, 7.490613, 9.576597, 6.659627, 4.377197, 15.617152, 2.762149, 14.928321, 11.186741, 4.816926, 9.672050, 7.001718, 1.800840, 3.284575, 17.308990, 5.648915, 4.966521, 3.618788, 4.711122, 3.146582, 4.679764, 9.379265, 12.000091, 3.854636, 8.663917, 4.736404, 13.138608, 9.440882, 8.672696, 5.330286, 9.666552, 9.960020, 21.045233, 10.448216, 4.918177, 9.592922, 6.169078, 16.501688, 2.957801, 15.028830</max>
		</layer>
		<layer>
			<name>conv2</name>
			<min>-9.464380, -10.253051, -8.556049, -7.419929, -10.144670, -9.123798, -9.735394, -8.528167, -1.910364, -9.677222, -10.271433, -11.502209, -8.789783, -10.234727, -8.882349, -10.666507, -9.891933, -9.252734, -9.122177, -10.603885, -10.329910, -9.849245, -8.081567, -10.263999, -10.375354, -11.191122, -11.890491, -11.452293, -10.902269, -10.484591, -9.543673, -12.568806, -11.574681, -10.337348, -11.024247, -5.132063, -4.460007, -5.987557, -8.783216, -10.570966, -9.785288, -8.808604, -10.860044, -9.902472, -8.767555, -8.907639, -6.551810, -10.146297, -10.430721, -10.583540, -9.811728, -11.052626, -11.408791, -10.083872, -11.069329, -7.946624, -9.532294, -10.922226, -6.829305, -7.965018, -10.683006, -11.331913, -11.106039, -9.129491</min>
			<max>8.552834, 3.318279, 5.434988, 6.118200, 6.036077, 3.590877, 4.280159, 2.414311, 6.203579, 4.053649, 4.922160, 3.480393, 4.219590, 3.524688, 7.026379, 4.804984, 3.330603, 4.647388, 3.976583, 5.859694, 5.235921, 4.736134, 3.457983, 6.079525, 3.915196, 4.070213, 4.868338, 4.639016, 5.362715, 5.506530, 4.541704, 3.380305, 4.441835, 3.805593, 3.460624, 8.676127, 7.398386, 7.741055, 1.306675, 5.448378, 1.560646, 2.021069, 4.570514, 5.174983, 2.651256, 5.620927, 5.532216, 5.083815, 3.583558, 5.380294, 3.946559, 5.829677, 4.601666, 3.415781, 5.057454, 7.028419, 5.394571, 4.920195, 3.676995, 10.047471, 5.330831, 5.166133, 9.037876, 5.158763</max>
		</layer>
		<layer>
			<name>conv3</name>
			<min>-5.917105, -7.234362, -5.964108, -6.066350, -5.410041, -6.513774, -5.909322, -5.804412, -5.649221, -5.688716, -5.612001, -7.264921, -6.076697, -4.765437, -6.474751, -5.753848, -5.281500, -4.715119, -6.207366, -7.220509, -7.029190, -6.137082, -5.385486, -4.965282, -6.530316, -5.891434, -5.402038, -5.662334, -6.303436, -5.826584, -5.120253, -5.113503, -4.220365, -5.922478, -6.114470, -6.043564, -3.952072, -7.498081, -6.230608, -5.488497, -6.054731, -5.365133, -7.491119, -5.338009, -6.716329, -3.017199, -5.578218, -5.773347, -6.088264, -5.777395, -6.156610, -6.261881, -7.438171, -5.980609, -5.572487, -5.133337, -7.164732, -6.291800, -6.728905, -5.903996, -6.423913, -7.622912, -5.173023, -5.895980, -7.067459, -5.773001, -6.610345, -5.998817, -7.092503, -6.312722, -6.526030, -5.208759, -5.881659, -3.669210, -12.076750, -5.050344, -7.126678, -6.099796, -7.258449, -6.311690, -6.368644, -5.003365, -5.790901, -5.352615, -5.211827, -5.995449, -5.956489, -6.031658, -5.548592, -7.356728, -5.944905, -5.575259, -4.921409, -6.552190, -6.761415, -6.358741</min>
			<max>3.722383, 4.834754, 4.075689, 4.090488, 5.817675, 3.272508, 3.721327, 3.038691, 3.857291, 5.784866, 5.643808, 7.085703, 3.130245, 4.630437, 3.999790, 3.904844, 3.885489, 4.584431, 3.466208, 3.644897, 3.283152, 3.481498, 3.449036, 4.425558, 3.408662, 3.570657, 3.524271, 4.347422, 3.277515, 3.714725, 4.392471, 5.073867, 4.633502, 4.615301, 5.028835, 3.824735, 7.925732, 3.337887, 3.680695, 3.944775, 3.191543, 5.618212, 4.198503, 3.362890, 3.873738, 5.593935, 4.461267, 3.451493, 3.423317, 4.772727, 4.221048, 3.133464, 4.075331, 3.851789, 4.401947, 4.299028, 4.542892, 3.401386, 3.007823, 4.309496, 2.952094, 4.952079, 4.297740, 4.879445, 4.320394, 3.638791, 2.168778, 4.285664, 4.687811, 4.466925, 3.806140, 4.602642, 5.143380, 5.574746, 2.340374, 3.646271, 3.060613, 4.433245, 3.023118, 3.389008, 4.150471, 3.982947, 3.383970, 4.795166, 3.933293, 4.696946, 3.219834, 4.458242, 4.542610, 4.198908, 4.855801, 3.381558, 6.231993, 3.875160, 2.982282, 4.573112</max>
		</layer>
		<layer>
			<name>conv4</name>
			<min>-2.987319, -4.586150, -2.956631, -2.766794, -3.061091, -2.942017, -2.617558, -3.255852, -3.397266, -2.676070, -3.000893, -3.414537, -3.369199, -3.029851, -3.025787, -3.189197, -4.360531, -3.494984, -2.651731, -2.401233, -3.908846, -3.366678, -2.853350, -2.753337, -3.925624, -3.639591, -2.959804, -3.906271, -3.177469, -3.109279, -3.596107, -4.067413, -4.357835, -3.108685, -3.127047, -3.688581, -3.718855, -3.515368, -2.819767, -3.013309, -2.976763, -3.445492, -3.303554, -2.893034, -4.360257, -3.426506, -3.273905, -3.766274, -3.077417, -3.780425, -3.647001, -4.261100, -3.001860, -3.910257, -3.478559, -3.423022, -3.758000, -3.188830, -2.394358, -3.082172, -3.128805, -3.221884, -2.987080, -3.102598, -2.341252, -3.081744, -3.394036, -2.514281, -3.503508, -3.368846, -3.126569, -3.307378, -3.319126, -3.443380, -4.369761, -3.730057, -5.317130, -2.964163, -4.211652, -3.250192, -3.137643, -3.261053, -4.062407, -2.698922, -3.178656, -3.534030, -3.710262, -2.810130, -3.126920, -3.172445, -3.408824, -3.334270, -2.990712, -3.346369, -3.411474, -3.467929, -3.747509, -3.207858, -2.123187, -3.232809, -3.205514, -3.089049, -3.617461, -2.764809, -3.120751, -3.372825, -2.201683, -2.510126, -3.231365, -2.555764, -3.391720, -3.067528, -2.698258, -3.230947, -3.877268, -2.791702, -3.579265, -2.908075, -2.752992, -4.142821, -3.833620, -3.667414, -3.048331, -3.079945, -2.710061, -2.882392, -3.088975, -3.402433, -2.901538, -3.340736, -2.676687, -2.916823, -3.624630, -2.803335, -2.643759, -4.580821, -3.689346, -3.250703, -2.156369, -2.623590, -2.850334, -3.133876, -4.038535, -3.365232, -3.143764, -3.939950, -3.239447, -5.374360, -3.221497, -3.358771, -2.983507, -2.569803, -3.279132, -3.105386, -2.864437, -3.848378, -2.562596, -3.598654, -3.410101, -3.391523, -3.035433, -3.051563, -3.054705, -2.883350, -3.258113, -3.205483, -3.595390, -4.030212, -3.741595, -2.396454, -3.247970, -2.884679, -2.422553, -2.979373, -4.477604, -2.690403, -3.079674, -1.539832, -3.708909, -2.358021, -2.726768, -3.668859, -3.168254, -2.281746, -2.998118, -3.134629, -2.739652, -4.421457, -4.026563, -3.478595, -2.586307, -3.908456</min>
			<max>3.649059, 3.043861, 3.368489, 3.476739, 3.542797, 3.406638, 3.599688, 3.311534, 3.250615, 3.430746, 3.406898, 3.187934, 3.398466, 2.623143, 2.855434, 3.858740, 2.241181, 3.017071, 3.665225, 3.463127, 2.713655, 2.845257, 3.307718, 3.425563, 3.502844, 3.210880, 2.851945, 3.224114, 2.817265, 3.790693, 3.122049, 3.537271, 3.309487, 3.921685, 2.677121, 3.167379, 2.886716, 3.459235, 3.456718, 3.322056, 3.427443, 3.320860, 3.336283, 5.000382, 2.728428, 3.214144, 2.849002, 2.953869, 2.945567, 3.046255, 2.808067, 2.277167, 3.780435, 3.112146, 3.810157, 3.154665, 3.698806, 3.831662, 3.017377, 3.442793, 3.009052, 3.126419, 3.067897, 3.324037, 2.702665, 3.324981, 3.424224, 4.691355, 2.638415, 3.054744, 3.339967, 2.544157, 3.408104, 2.885684, 2.905465, 3.848423, 3.447692, 3.571713, 3.203981, 2.867126, 3.459140, 3.541317, 3.323525, 2.444700, 4.230744, 4.043742, 4.644354, 3.513038, 2.801121, 3.728350, 3.399635, 3.566219, 3.385897, 3.292043, 3.084771, 3.188783, 2.745549, 2.980575, 4.684607, 3.327256, 3.564421, 4.559337, 3.648043, 3.237991, 2.589468, 3.471761, 3.141582, 4.273114, 2.114797, 4.974995, 2.782206, 3.923402, 3.718357, 2.698570, 2.856775, 4.257745, 2.616345, 3.131604, 4.300604, 2.684216, 4.496405, 2.877058, 3.222427, 3.111189, 3.384398, 3.471773, 2.696117, 3.848113, 3.135997, 3.762882, 3.710487, 3.488646, 3.417352, 3.436089, 3.862054, 2.517044, 2.645833, 3.231008, 3.667187, 3.386210, 3.766098, 3.553118, 4.397314, 2.918634, 2.856196, 3.283678, 3.505096, 2.722870, 3.298469, 3.284572, 3.224442, 3.330746, 3.255150, 2.932532, 3.608357, 4.302376, 3.952786, 2.925580, 3.184250, 3.915471, 3.567536, 2.751724, 3.349856, 3.389224, 3.631702, 2.967105, 2.555817, 1.900369, 2.280053, 3.544369, 3.158507, 2.948700, 3.029984, 3.015389, 3.098863, 3.933085, 3.340601, 4.238146, 3.242674, 2.950555, 3.278508, 4.495758, 3.134241, 3.629265, 4.835647, 3.803707, 3.592745, 2.999431, 3.003747, 2.685576, 4.284883, 3.808530</max>
		</layer>
		<layer>
			<name>conv5</name>
			<min>-2.740184, -1.679526, -2.636216, -3.877392, -0.021671, -0.028755, -0.018179, -0.024637, -3.257909, -1.869277, -5.216764, -0.018143, -0.019972, -0.034962, -0.021603, -0.017317, -0.019020, -0.029757, -0.027675, -0.020289, -0.026445, -0.027695, -0.026751, -0.025900, -0.047702, -0.019089, -0.022417, -0.015613, -2.827382, -2.098511, -0.030797, -0.029488, -5.636631, -0.019414, -3.311083, -0.025999, -0.013674, -0.025636, -0.031636, -0.015197, -0.011783, -0.024036, -0.023350, -0.017421, -0.010998, -0.019817, -0.013870, -0.018142, -0.021666, -0.024165, -0.023933, -0.005575, -0.021745, -3.197711, -0.026875, -3.697165, -0.029124, -1.489800, -0.014978, -0.043153, -0.029260, -0.013786, -0.089189, -0.016845, -0.015396, -3.807836, -0.770373, -2.817709, -1.445759, -0.008197, -0.022343, -0.032854, -7.723591, -0.017738, -0.017369, -5.805578, -0.019364, -1.396878, -0.863609, -0.010934, -0.021336, -1.321984, -0.024535, -0.040676, -0.044601, -2.063869, -0.043711, -0.018107, -4.500033, -0.648264, -0.019765, -0.016348, -0.023611, -0.019374, -0.024307, -0.024930, -0.033447, -0.026111, -0.026488, -3.510396, -0.020302, -0.026692, -4.835413, -0.026738, -0.025870, -2.476004, -2.201906, -0.032814, -0.532639, -0.017908, -0.022412, -0.051197, -0.019374, -0.025331, -0.026682, -0.017219, -0.022301, -1.466686, -0.016088, -0.016134, -0.022688, -0.022924, -0.026897, -0.023570, -0.017477, -0.033195, -0.022606, -0.015497, -0.013601, -0.015943, -2.778025, -0.019288, -0.039460, -0.015476, -4.798691, -0.021679, -0.019630, -0.031286, -0.920253, -0.024791, -0.024918, -4.867188, -0.024314, -0.134501, -1.545062, -0.016263, -0.030621, -0.654277, -0.025689, -0.044696, -4.373409, -4.155466, -0.792962, -0.014718, -0.031732, -0.019470, -0.044754, -0.015675, -0.020019, -0.026789, -0.025914, -0.238948, -6.452367, -3.659939, -3.146253, -0.024107, -0.019655, -2.730482, -0.023675, -0.021361, -0.023520, -3.929312, -0.028861, -0.022699, -0.012213, -0.022701, -0.023897, -0.044589, -4.334893, -7.542370, -0.015817, -0.014100, -0.041008, -0.016613, -0.024558, -3.393721, -4.517964, -0.402876, -0.028418, -0.028170, -0.020410, -0.024863, -2.465549, -1.911394, -0.022791, -0.027862, -0.015444, -1.980416, -0.030774, -0.039390, -5.386621, -0.029718, -0.019970, -0.037736, -1.650073, -0.030502, -0.028123, -0.036004, -0.015552, -0.022527, -0.020674, -0.010873, -0.035062, -0.026703, -4.300099, -0.019524, -0.026962, -3.258720, -0.014834, -0.030310, -0.023635, -5.401586, -0.015835, -0.025696, -3.841904, -4.670284, -0.014080, -0.010732, -0.010242, -5.648753, -0.023032, -0.015981, -0.022010, -0.021564, -0.017590, -0.020002, -0.032364, -0.024549, -0.023716, -1.659130, -0.038569, -1.197812, -0.018182, -1.928737, -0.018584, -0.021762, -2.501001, -0.024406, -1.462626, -2.896584, -0.013074, -0.012125, -0.025285, -0.032886, -0.024577, -0.015923</min>
			<max>2.022058, 0.850954, 2.790629, 0.101421, -0.020071, -0.026792, -0.016293, -0.023118, 0.790084, 0.753762, 1.115015, -0.016772, -0.018545, -0.033019, -0.019645, -0.015769, -0.017249, -0.027840, -0.025770, -0.018752, -0.024806, -0.025970, -0.024445, -0.024026, -0.045225, -0.017297, -0.020984, -0.014169, 0.692485, 1.705644, -0.028999, -0.027673, 2.045155, -0.017879, 0.338364, -0.024114, -0.011886, -0.023861, -0.029610, -0.013809, -0.010245, -0.022577, -0.021806, -0.015924, -0.009401, -0.018317, -0.012185, -0.016643, -0.020000, -0.022498, -0.022232, -0.003556, -0.020307, 1.332679, -0.024847, 0.641170, -0.027691, 1.334713, -0.012983, -0.040918, -0.027550, -0.012329, 0.061608, -0.015180, -0.013409, 1.129244, 0.490474, 2.155030, 0.918344, -0.006508, -0.020624, -0.030983, 0.003274, -0.016197, -0.015577, 2.721582, -0.017388, 1.279168, 0.593887, -0.009374, -0.019728, 0.310233, -0.023048, -0.038774, -0.042570, 0.901064, -0.041959, -0.016163, 1.533677, 0.405189, -0.018159, -0.014732, -0.022141, -0.017560, -0.022917, -0.022991, -0.031702, -0.024474, -0.024808, 0.298317, -0.018547, -0.025049, 0.414027, -0.024861, -0.024008, 1.394559, 0.707352, -0.030555, 0.961893, -0.016217, -0.020786, -0.048889, -0.017788, -0.023400, -0.024631, -0.015756, -0.020417, 1.429456, -0.013751, -0.014263, -0.020885, -0.021475, -0.025194, -0.021586, -0.015718, -0.030841, -0.020930, -0.014101, -0.012055, -0.014251, 0.905646, -0.017616, -0.037691, -0.013896, 2.043976, -0.019967, -0.017834, -0.029641, 0.761788, -0.022749, -0.023052, 0.718836, -0.022727, 0.465234, 0.963592, -0.014681, -0.029031, 0.421921, -0.024186, -0.042703, -0.074150, 1.025839, 0.616892, -0.013134, -0.030134, -0.017576, -0.042377, -0.013846, -0.018387, -0.025197, -0.024302, 0.220824, 4.829723, 0.352223, 0.534877, -0.022521, -0.017949, 1.131254, -0.021984, -0.019766, -0.021318, 1.345921, -0.027286, -0.020895, -0.010522, -0.020925, -0.022362, -0.042178, 0.726914, -0.370816, -0.014069, -0.012593, -0.038535, -0.015095, -0.023047, 1.939949, 2.593887, 0.063447, -0.026350, -0.026433, -0.018833, -0.023110, 1.228666, 1.482191, -0.021242, -0.025896, -0.013397, 1.046149, -0.028249, -0.037488, 0.670707, -0.027812, -0.018287, -0.035661, 1.069314, -0.028971, -0.026510, -0.034044, -0.014083, -0.020865, -0.019060, -0.009162, -0.032541, -0.024921, -0.887577, -0.017783, -0.025151, 2.663877, -0.012988, -0.028427, -0.022037, 1.307906, -0.014419, -0.023695, 4.327434, 0.268358, -0.012340, -0.009415, -0.008617, 2.034319, -0.021320, -0.014630, -0.020471, -0.020306, -0.015259, -0.018357, -0.030455, -0.022778, -0.021961, 1.447146, -0.036281, 1.081739, -0.016538, 0.855457, -0.016978, -0.020220, 1.585803, -0.022854, 0.236210, 0.398731, -0.011352, -0.010034, -0.023535, -0.031132, -0.023162, -0.014361</max>
		</layer>
		<layer>
			<name>data</name>
			<min>0.000000, 0.000000, 0.000000</min>
			<max>255.000000, 255.000000, 255.000000</max>
		</layer>
		<layer>
			<name>gender_conv1</name>
			<min>-0.534000, -0.584758, -0.017047, -0.522227, -0.439346, -0.042464, -0.708263, -0.035529, -0.740680, -0.286905, -0.565349, -0.062541, -0.520371, -0.027127, -0.394897, -0.465851, -0.343799, -0.048284, -0.042081, -0.371229, -0.433090, -0.329874, -0.534349, -0.069650, -0.367032, -0.430227, -0.266091, -0.347685, -0.033723, -0.524751, -0.067026, -0.355536, -0.376711, -0.528703, -0.283650, -0.380407, -0.039174, -0.399453, -0.020903, -0.086061, -0.429231, -0.779350, -0.559564, -0.301208, -0.033480, -0.706039, -0.478384, -0.473346, -0.595145, -0.556657, -0.336304, -0.430774, -0.025849, -0.390032, -0.708376, -0.518044, -0.044253, -0.595390, -0.520305, -0.504856, -0.528438, -0.259031, -0.469818, -0.456658, -0.044612, -0.413760, -0.544428, -0.406605, -0.042407, -0.646476, -0.581487, -0.378123, -0.029175, -0.466730, -0.356032, -0.318897, -0.313747, -0.264852, -0.656214, -0.287435, -0.646537, -0.472398, -0.065227, -0.069210, -0.354963, -0.420108, -0.221160, -0.423453, -0.437506, -0.254707, -0.522077, -0.508235, -0.379897, -0.364480, -0.304171, -0.362656, -0.496474, -0.576087, -0.497359, -0.398364, -0.445874, -0.444455, -0.768716, -0.223163, -0.306660, -0.493683, -0.538959, -0.298446, -0.397605, -0.054303, -0.430552, -0.371132, -0.441983, -0.306722, -0.029425, -0.023879, -0.483707, -0.441044, -0.360493, -0.362529, -0.393681, -0.473250, -0.241285, -0.055840, -0.445642, -0.506483, -0.277501, -0.375836, -0.357228, -0.045208, -0.375463, -0.546894, -0.439319, -0.519506, -0.334448, -0.053249, -0.602862, -0.284070, -0.260346, -0.618732, -0.399445, -0.246036, -0.471290, -0.582704, -0.390790, -0.482079, -0.248605, -0.501225, -0.422585, -0.397900, -0.396056, -0.319398, -0.052568, -0.545538, -0.330307, -0.064390, -0.400804, -0.628222, -0.665343, -0.504147, -0.481372, -0.329984, -0.521313, -0.455768, -0.053183, -0.059972, -0.415132, -0.469721, -0.516989, -0.696029, -0.387524, -0.368345, -0.052765, -0.018935, -0.431067, -0.265691, -0.409635, -0.410547, -0.450670, -0.487815, -0.594527, -0.041764, -0.026969, -0.382786, -0.373541, -0.629588, -0.360082, -0.650392, -0.438052, -0.638801, -0.307269, -0.416334, -0.508564, -0.588326, -0.714038, -0.431274, -0.447710, -0.831291, -0.035520, -0.242658, -0.727036, -0.389470, -0.026232, -0.461461, -0.495303, -0.061225, -0.444342, -0.159062, -0.351545, -0.365249, -0.391087, -0.364129, -0.272844, -0.361599, -0.508587, -0.396783, -0.451434, -0.045931, -0.248262, -0.419871, -0.640449, -0.025876, -0.436366, -0.483538, -0.635751, -0.366471, -0.033335, -0.308157, -0.315168, -0.627253, -0.247776, -0.392054, -0.025521, -0.368177, -0.581256, -0.501711, -0.325461, -0.260075, -0.062691, -0.583699, -0.525334, -0.776738, -0.048646, -0.469745, -0.478474, -0.574833, -0.010426, -0.332390, -0.580959, -0.504357, -0.312179, -0.047398, -0.298856, -0.383181, -0.040415, -0.387720</min>
			<max>0.368256, 0.233432, -0.016897, 0.507718, 0.417284, -0.042269, 0.268875, -0.035324, 0.391196, 0.161366, 0.357247, -0.062361, 0.278263, -0.026919, 0.171553, 0.379033, 0.509994, -0.047970, -0.041845, 0.221641, 0.381514, 0.323918, 0.130600, -0.069464, 0.460122, 0.244780, 0.612279, 0.425998, -0.033549, 0.312399, -0.066782, 0.151584, 0.231143, 0.263889, 0.266621, 0.063806, -0.038993, 0.713100, -0.020646, 0.811256, 0.750572, 0.291079, 0.253848, 0.371904, -0.033298, 0.245625, 0.368789, 0.477754, 0.335230, 0.388138, 0.292382, 0.370576, -0.025629, 0.414375, 0.300091, 0.353459, -0.044043, 0.250541, 0.295355, 0.275185, 0.290924, 0.506240, 0.301032, 0.691453, -0.044412, 0.671284, 0.324778, 0.163778, -0.042228, 0.321859, 0.361461, 0.536540, -0.029012, 0.332888, 0.266829, 0.618821, 0.325301, 0.516691, 0.275528, 0.191257, 0.340147, 0.240023, -0.065045, -0.069008, 0.303959, 0.259863, -0.074019, 0.239888, 0.333112, 0.455715, 0.437912, 0.180464, 0.310341, 0.464992, 0.584301, 0.436930, 0.297181, 0.294779, 0.370687, 0.251490, 0.129091, 0.872009, 0.254950, -0.094191, 0.351397, 0.467915, 0.417067, 0.442835, 0.187235, -0.054112, 0.372742, 0.577703, 0.394992, 0.186576, -0.029261, -0.023577, 0.304619, 0.446277, 0.238917, 0.321384, 0.302793, 0.246438, 0.046883, -0.055631, 0.830902, 0.394074, 0.131109, 0.369501, 0.309454, -0.045006, 0.248310, 0.308717, 0.204379, 0.384667, 0.395658, -0.053084, 0.296271, 0.288999, 0.927272, 0.335601, 0.512052, 0.040492, 0.177812, 0.456119, 0.283208, 0.416636, 0.193211, 0.334887, 0.379505, 0.518457, 0.217063, 0.818474, -0.052297, 0.222863, 0.212327, -0.064210, 0.292423, 0.376714, 0.320924, 0.276173, 0.307767, 0.329089, 0.176889, 0.433356, -0.052948, -0.059806, 0.446333, 0.215441, 0.378839, 0.272479, 0.277049, 0.405508, -0.052607, -0.018686, 0.331860, -0.081686, 0.512257, 0.238928, 0.211167, 0.501409, 0.349763, -0.041578, -0.026582, 0.294997, 0.496472, 0.250556, 0.321718, 0.237127, 0.416562, 0.343176, 0.294820, 0.453716, 0.215807, 0.270527, 0.243452, 0.358930, 0.125256, 0.286654, -0.035328, 0.128845, 0.303572, 0.316651, -0.025976, 0.316637, 0.378990, -0.060907, 0.442249, 0.038270, 0.221723, 0.313702, 0.195362, 0.375896, 0.442647, 0.355601, 0.408186, 0.485453, 0.307666, -0.045691, -0.121313, 0.508064, 0.287939, -0.025672, 0.303698, 0.570459, 0.341116, 0.264224, -0.033108, 0.209944, 0.918800, 0.272838, 0.382241, 0.369175, -0.025317, 0.196491, 0.206151, 0.160309, -0.124414, 0.376833, -0.062432, 0.301650, 0.187560, 0.264788, -0.048458, 0.472891, 0.365067, 0.227637, -0.010181, 0.394758, 0.202248, 0.192884, 0.220949, -0.047158, 0.715288, 0.496241, -0.040207, 0.397174</max>
